#Задача «Сложная сдача».
a=int(input("Сколько денег дал покупатель?"))
sdacha=a-4.5*34
print(sdacha)
