#Задача «Сдача всем».
price=int(input("Цена товара"))
weight=int(input("Вес товара"))
money=int(input("Количество денег у покупателя"))
print(money-price*weight)