#Задача «Самая простая задача на свете»
n=int(input("Введите число"))
print("Купи конструктор!"*n)