#Задача «Автоматизируем простоту!».
enjoy_deal=input("Любимое дело")
n=int(input("натурально число"))
print(n*("  Обожаю писать  "+'"'+enjoy_deal+'"'))